In [45]:
import pandas as pd

In [46]:
df = pd.read_csv("students.csv")

In [47]:
df

   Student_ID    Name  Age Gender Department  Marks   Join_Date
0         101  Ananya   20      F         CS     85  2022-08-01
1         102   Rohan   21      M         EE     78  2021-09-01
2         103   Priya   19      F         CS     92  2023-01-10
3         104  Vikram   22      M         ME     69  2020-07-15
4         105   Sweta   20      F         EE     88  2022-03-20

In [48]:
df[df["Department"] == "CS"]

   Student_ID    Name  Age Gender Department  Marks   Join_Date
0         101  Ananya   20      F         CS     85  2022-08-01
2         103   Priya   19      F         CS     92  2023-01-10

In [49]:
[df.groupby("Department")["Marks"].mean()]

[Department
 CS    88.5
 EE    83.0
 ME    69.0
 Name: Marks, dtype: float64]

In [50]:
df[df["Join_Date"].str[:4].astype(int) > 2022]

   Student_ID   Name  Age Gender Department  Marks   Join_Date
2         103  Priya   19      F         CS     92  2023-01-10

In [51]:
df["Grade"] = df["Marks"].apply(lambda x: "A" if x >= 90 else ("B" if x >= 75 and x <= 89 else "C"))

In [52]:
df

   Student_ID    Name  Age Gender Department  Marks   Join_Date Grade
0         101  Ananya   20      F         CS     85  2022-08-01     B
1         102   Rohan   21      M         EE     78  2021-09-01     B
2         103   Priya   19      F         CS     92  2023-01-10     A
3         104  Vikram   22      M         ME     69  2020-07-15     C
4         105   Sweta   20      F         EE     88  2022-03-20     B

In [53]:
df["Join_Date"] = pd.to_datetime(df["Join_Date"])

In [55]:
df.dtypes

Student_ID             int64
Name                  object
Age                    int64
Gender                object
Department            object
Marks                  int64
Join_Date     datetime64[ns]
Grade                 object
dtype: object

In [58]:
df["Join_Year"] = df["Join_Date"].dt.year

In [59]:
df

,Student_ID,Name,Age,Gender,Department,Marks,Join_Date,Grade,Join_Year
0,101,Ananya,20,F,CS,85,2022-08-01,B,2022
1,102,Rohan,21,M,EE,78,2021-09-01,B,2021
2,103,Priya,19,F,CS,92,2023-01-10,A,2023
3,104,Vikram,22,M,ME,69,2020-07-15,C,2020
4,105,Sweta,20,F,EE,88,2022-03-20,B,2022